# test_dalle3_detailed.py
# запуск  python test_dalle3_detailed.py

import replicate
import os

# ✅ ПРАВИЛЬНЫЙ ТОКЕН В КАВЫЧКАХ
os.environ["REPLICATE_API_TOKEN"] = "r8_U5d7rljYIDPGnffQkcVKHixtJNVsUHN1BspkN"

# ✅ ЖЁСТКИЙ ДЕТАЛЬНЫЙ ПРОМТ
ULTRA_DETAILED_PROMPT = """
Вы мастер дизайна мирового уровня.
Создайте  дизайн комнаты для девочки и выведите его в ультра фотореалистичном режиме.
Дизайн должен быть не придуманным, не вымышленным, а жизненным и простым, без компьютерных стульев.
Запрещено добавлять мебель, предметы и интерьер не указанные в запросе.
Стиль: минимализм.
Детали:
комната ширина - 3 метра, длина -5 метров, высота потолков -2, 7 метра.

Мебель: диван, телевизор, ноутбук, угловой стол, кресло компьютерное.
Интерьер: стены розовые без обоев, пол ламинат очень темный в одном направлении от окна, 
потолок обычный не наваесной - белый.
"""

print("🧪 ТЕСТИРОВАНИЕ ЖЁСТКОГО ПРОМТА...")
print(f"📝 Промт длина: {len(ULTRA_DETAILED_PROMPT)} символов")
print("⏳ Генерирую изображение...")

try:
    output = replicate.run(
        "openai/dall-e-3",
        input={
            "prompt": ULTRA_DETAILED_PROMPT,
            "size": "1024x1024",
        }
    )

    print(f"🔍 Output type: {type(output)}")
    print(f"🔍 Output: {output}")

    # ✅ ПРАВИЛЬНАЯ ОБРАБОТКА
    if output:
        if isinstance(output, list) and len(output) > 0:
            file_obj = output[0]
            if hasattr(file_obj, 'url'):
                image_url = file_obj.url
            else:
                image_url = str(file_obj)
        elif hasattr(output, 'url'):
            image_url = output.url
        else:
            image_url = str(output)

        print(f"✅ УСПЕШНО!")
        print(f"📸 URL: {image_url}")

        # Открыть в браузере
        import webbrowser

        webbrowser.open(image_url)
        print("🌐 Открыто в браузере")
    else:
        print("❌ Ошибка: Пустой ответ")

except Exception as e:
    print(f"❌ Ошибка: {e}")
    import traceback

    traceback.print_exc()
